# ElementHasFlowCalculation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..ElementHasFlowCalculation Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
This element has an open connection. This may not be an error, but for flow calculations to work correctly all connections should be sealed with an end cap.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementHasFlowCalculation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementHasFlowCalculation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementHasFlowCalculation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace